app/controllers/companies_controller.rb

  def index
    @company = Company.all
---
SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def show
    @company = Company.find(permitted_params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @company = Company.new(permitted_params[:company])

    if @company.save
---
INSERT INTO "companies" ("name", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["details", ""], ["created_at", "2020-06-10 13:50:26.719641"], ["updated_at", "2020-06-10 13:50:26.719641"]]

  def destroy
    @company = Company.find(permitted_params[:id])
    @company.destroy
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 7]]