app/controllers/employees_controller.rb

  def edit
    # byebug
    @employee = Employee.find(permitted_params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def create
    @employee = @company.employees.build(permitted_params[:employee])
    if @employee.save
---
INSERT INTO "employees" ("forename", "surname", "created_at", "updated_at", "company_id", "middlename") VALUES (?, ?, ?, ?, ?, ?)  [["forename", "Renata"], ["surname", "Miriuk"], ["created_at", "2020-06-30 10:29:04.456511"], ["updated_at", "2020-06-30 10:29:04.456511"], ["company_id", 11], ["middlename", ""]]

  def update
    byebug
    @emp = Employee.find(permitted_params[:id])
    if @employee.update(forename: permitted_params[:forename],
                        surname: permitted_params[:surname])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "forename" = ?, "surname" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["forename", "Goofy the dog"], ["surname", "Cartoon but not a real dog"], ["updated_at", "2020-06-10 12:40:40.394312"], ["id", 1]]

  def set_employee
    @employee = Employee.find(permitted_params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def find_company
    @company = Company.find(permitted_params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]